In [1]:
import numpy as np

import pandas as pd

from pandas import Series,DataFrame

In [5]:
ser1 = Series(np.arange(3),index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [7]:
ser2 = Series(np.arange(4),index=['A','B','C','D'])
ser2

A    0
B    1
C    2
D    3
dtype: int32

In [19]:
(ser1+ser2).fillna(0).astype('int64')

A    0
B    2
C    4
D    0
dtype: int64

In [25]:
dframe = DataFrame(np.arange(25).reshape(5,5),columns=list('ABCDF'),index=['r1','r2','r3','r4','r5'])
dframe

     A   B   C   D   F
r1   0   1   2   3   4
r2   5   6   7   8   9
r3  10  11  12  13  14
r4  15  16  17  18  19
r5  20  21  22  23  24

In [31]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),columns=list('ABDF'),index=['r1','r2','r3','r4'])
dframe2

     A   B   D   F
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15

In [35]:
dframe+dframe2

       A     B   C     D     F
r1   0.0   2.0 NaN   5.0   7.0
r2   9.0  11.0 NaN  14.0  16.0
r3  18.0  20.0 NaN  23.0  25.0
r4  27.0  29.0 NaN  32.0  34.0
r5   NaN   NaN NaN   NaN   NaN

In [39]:
dframe.add(dframe2,fill_value=0).astype('int64')

     A   B   C   D   F
r1   0   2   2   5   7
r2   9  11   7  14  16
r3  18  20  12  23  25
r4  27  29  17  32  34
r5  20  21  22  23  24

In [43]:
ser3 = dframe2.loc['r4']
ser3

A    12
B    13
D    14
F    15
Name: r4, dtype: int32

In [45]:
dframe2-ser3

     A   B   D   F
r1 -12 -12 -12 -12
r2  -8  -8  -8  -8
r3  -4  -4  -4  -4
r4   0   0   0   0